environments/wrk_http_benchmarking_hard/environment/data/benchmarks/endpoint_users_benchmark.txt
Running 30s test @ http://api.internal.company.com/v1/users
  10 threads and 400 connections
  Thread calibration: mean lat.: 89.453ms, rate sampling interval: 234ms
  Thread calibration: mean lat.: 91.267ms, rate sampling interval: 241ms
  Thread calibration: mean lat.: 88.921ms, rate sampling interval: 229ms
  Thread calibration: mean lat.: 90.534ms, rate sampling interval: 237ms
  Thread calibration: mean lat.: 89.782ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 92.103ms, rate sampling interval: 245ms
  Thread calibration: mean lat.: 87.654ms, rate sampling interval: 226ms
  Thread calibration: mean lat.: 91.876ms, rate sampling interval: 243ms
  Thread calibration: mean lat.: 88.345ms, rate sampling interval: 228ms
  Thread calibration: mean lat.: 90.192ms, rate sampling interval: 235ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.34ms   31.56ms  412.87ms   74.23%
    Req/Sec    98.45     15.67    145.00     68.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   78.23ms
 75.000%   98.56ms
 90.000%  121.34ms
 99.000%  145.78ms
 99.900%  287.45ms
 99.990%  356.89ms
 99.999%  398.12ms
100.000%  412.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.543     0.000000            1         1.00
      35.679     0.100000         2978         1.11
      48.234     0.200000         5934         1.25
      59.871     0.300000         8912         1.43
      68.543     0.400000        11876         1.67
      78.231     0.500000        14845         2.00
      83.456     0.550000        16334         2.22
      88.723     0.600000        17812         2.50
      93.287     0.650000        19298         2.86
      95.871     0.700000        20789         3.33
      98.559     0.750000        22267         4.00
     101.343     0.775000        23012         4.44
     104.895     0.800000        23751         5.00
     108.479     0.825000        24493         5.71
     112.895     0.850000        25237         6.67
     116.927     0.875000        25978         8.00
     119.103     0.887500        26351         8.89
     121.343     0.900000        26721        10.00
     124.287     0.912500        27092        11.43
     127.615     0.925000        27463        13.33
     131.199     0.937500        27834        16.00
     133.247     0.943750        28019        17.78
     135.423     0.950000        28205        20.00
     137.855     0.956250        28390        22.86
     140.543     0.962500        28575        26.67
     143.615     0.968750        28761        32.00
     145.023     0.971875        28853        35.56
     145.783     0.975000        28946        40.00
     148.095     0.978125        29039        45.71
     151.167     0.981250        29131        53.33
     155.519     0.984375        29224        64.00
     158.207     0.985938        29270        71.11
     161.791     0.987500        29316        80.00
     166.399     0.989062        29363        91.43
     172.287     0.990625        29409       106.67
     179.967     0.992188        29455       128.00
     184.831     0.992969        29478       142.22
     190.463     0.993750        29501       160.00
     197.631     0.994531        29524       182.86
     206.847     0.995313        29547       213.33
     218.367     0.996094        29571       256.00
     224.767     0.996484        29582       284.44
     232.191     0.996875        29594       320.00
     241.023     0.997266        29605       365.71
     251.135     0.997656        29617       426.67
     262.655     0.998047        29628       512.00
     269.055     0.998242        29634       568.89
     275.967     0.998437        29640       640.00
     283.903     0.998633        29646       731.43
     292.351     0.998828        29652       853.33
     302.591     0.999023        29657      1024.00
     308.479     0.999121        29660      1137.78
     315.647     0.999219        29663      1280.00
     323.327     0.999316        29666      1462.86
     332.287     0.999414        29669      1706.67
     341.503     0.999512        29672      2048.00
     346.623     0.999561        29674      2275.56
     351.231     0.999609        29675      2560.00
     356.863     0.999658        29677      2925.71
     363.519     0.999707        29678      3413.33
     370.431     0.999756        29680      4096.00
     373.247     0.999780        29681      4551.11
     376.575     0.999805        29682      5120.00
     381.439     0.999829        29683      5851.43
     385.279     0.999854        29684      6826.67
     389.631     0.999878        29685      8192.00
     391.935     0.999890        29685      9102.22
     398.079     0.999902        29686     10240.00
     398.335     0.999915        29686     11702.86
     402.175     0.999927        29687     13653.33
     402.175     0.999939        29687     16384.00
     405.503     0.999945        29687     18204.44
     408.063     0.999951        29688     20480.00
     408.063     0.999957        29688     23405.71
     408.063     0.999963        29688     27306.67
     408.063     0.999969        29688     32768.00
     408.063     0.999973        29688     36408.89
     412.927     0.999976        29689     40960.00
     412.927     1.000000        29689          inf
#[Mean    =       82.339, StdDeviation   =       31.562]
#[Max     =      412.864, Total count    =        29689]
#[Buckets =           27, SubBuckets     =         2048]
  29629 requests in 30.02s, 14.87MB read
  Requests/sec:    987.65
  Transfer/sec:    507.23KB